[
    {
        "name": "brittany",
        "location": "Canada",
        "country": "CA",
        "review": "Abeera was great from start to finish! Quick, efficient and great communication! Would HIGHLY recommend!"
    },
    {
        "name": "omrigonen",
        "location": "Israel",
        "country": "IL",
        "review": "Good job 👍 seller was very committed to the success of the project and worked fast and effective. We would absolutely use her services again."
    },
    {
        "name": "timlam",
        "location": "Hong Kong",
        "country": "HK",
        "review": "Thanks. Done."
    },
    {
        "name": "supremeceo",
        "location": "United States",
        "country": "AU",
        "review": "Excellent work totally satisfied."
    },
    {
        "name": "sandra",
        "location": "United States",
        "country": "AU",
        "review": "Abeera was great to work with. She is a hard worker, great at communicating, very punctual, and provides excellent work. She is very quick to answer messages and efficient with the book covers. I would work with her again."
    },
    {
        "name": "vickipatton",
        "location": "United States",
        "country": "AU",
        "review": "You did such a great job! I absolutely love that you took all of my feedback into consideration and changed the first PDF. It really shows in the 2nd PDF that you considered all of my feedback. I will definitely work with you again Abeera because you know how to handle feedback and put it into action!!!! And the communication was great, you updated me every step of the way!"
    },
    {
        "name": "sandy",
        "location": "United States",
        "contry": "AU",
        "review": "Smooth, simple process."
    },
    {
        "name": "allensuber",
        "location": "United States",
        "contry": "AU",
        "review": "Simply Outstanding. I have worked with this seller before and reached out to work with the seller directly again, and again. Excellent customer service skills, diverse skill set, and fast delivery. Looking forward to working with this seller on future projects."
    },
    {
        "name": "kkeala",
        "location": "United States",
        "contry": "AU",
        "review": "Quick response and turnaround to every request."
    },
    {
        "name": "charlton",
        "location": "United States",
        "contry": "AU",
        "review": "Everything was done in a timely manner and my ebook is beautiful. She did a wonderful job; she is very creative."
    },
    {
        "name": "petra",
        "location": "Spain",
        "contry": "ES",
        "review": "Excellent communication skills and always going above and beyond to make sure everything is 100% perfect."
    },
    {
        "name": "greensystemsinc",
        "location": "Canada",
        "review": "Excellent work!! Fast delivery!! Highly recommended!! Will buy more!!"
    },
    {
        "name": "allensuber",
        "location": "United States",
        "contry": "AU",
        "review": "Outstanding Results! Excellent communication throughout the process, exceeding my expectations. Very professional, attention to detail, courteous, and fast! Completed the project ahead of schedule with no required revisions. My best experience on Fiverr by far. I would certainly use Abeera again and again."
    },
    {
        "name": "marcelo",
        "location": "United States",
        "contry": "AU",
        "review": "Amazing work!! Clean, concise and awesome turn around time."
    },
    {
        "name": "liztal",
        "location": "United States",
        "contry": "AU",
        "review": "Wonderful communication and turnaround time. Will definitely work with Abeera again!"
    },
    {
        "name": "nabeel",
        "location": "Pakistan",
        "contry": "PK",
        "review": "Abeera understood the requirement very well. Communication remained very smooth. She delivered a good product. The experience was great."
    },
    {
        "name": "zendone",
        "location": "United States",
        "contry": "AU",
        "review": "Good and fast."
    },
    {
        "name": "latifa",
        "location": "United Arab Emirates",
        "contry": "AE",
        "review": "She's great. It's my second time working with her and it won't be my last."
    },
    {
        "name": "happybrutalist",
        "location": "United States",
        "contry": "AU",
        "review": "Was a great pleasure working with Abeera. Very communicative, asked all the questions she needed before pursuing the work. Was happy to make changes and try out different ideas. Bonus points for knowing I was in a rush and taking care of grammar and spelling errors for me. Highly recommended and will definitely work with her again."
    },
    {
        "name": "alex",
        "location": "United States",
        "contry": "AU",
        "review": "Very impressed rewritten by Abeera, thank you so much for your nice work!!"
    },
    {
        "name": "sweet_diana",
        "location": "United States",
        "contry": "AU",
        "review": "Words cannot merely express how grateful I was after receiving the finalization of my project. Tears flowed deeply as I gazed at the beautiful, touching, and magical book created by the absolute best seller in the world! She went above and beyond in creating this personalized book in a way that it will be remembered for years to come, and that was my sole purpose! My Goddaughter will hold on to this treasure with such grace, and I can't describe the feeling any better than that! Thank you so much for your professionalism, creativity, and, most importantly, for exceeding my expectations! You are greatly appreciated, and I am looking forward to doing business with you in the future."
    }
]